// This is the KM10 CPU implementation.
#pragma once
#include <string>
#include <cstdint>
#include <sstream>
#include <iomanip>
#include <fstream>
#include <iostream>
#include <limits>
#include <functional>

using namespace std;

#include "w36.hpp"


class KM10 {
public:
  W36 AC[16];
  W36 pc;

  union ProgramFlags {

    struct ATTRPACKED {
      unsigned ndv: 1;
      unsigned fuf: 1;
      unsigned tr1: 1;
      unsigned tr2: 1;
      unsigned afi: 1;
      unsigned pub: 1;
      unsigned pcu: 1;
      unsigned usrIO: 1;
      unsigned usr: 1;
      unsigned fpd: 1;
      unsigned fov: 1;
      unsigned cy0: 1;
      unsigned cy1: 1;
      unsigned ov: 1;
    };

    unsigned u: 13;
  } flags;

  // Pointer to current virtual memory mapping in emulator.
  W36 *memP;

  bool running;
  bool tracePC;
  bool traceAC;
  bool traceMem;

  uint64_t maxInsns;


  // CONO PAG state bits
  union PAGState {

    struct ATTRPACKED {
      unsigned execBasePage: 13;
      unsigned enablePager: 1;
      unsigned tops2Paging: 1;
      unsigned: 1;
      unsigned cacheStrategyLoad: 1;
      unsigned cacheStrategyLook: 1;
    };

    unsigned u: 18;

    PAGState() :u(0) {};
  } pagState;


  // CONI APR interrupt flags
  union APRFlags {

    struct ATTRPACKED {
      unsigned sweepDone: 1;
      unsigned powerFailure: 1;
      unsigned addrParity: 1;
      unsigned cacheDirParity: 1;
      unsigned mbParity: 1;
      unsigned ioPageFail: 1;
      unsigned noMemory: 1;
      unsigned sbusError: 1;
    };

    unsigned u: 8;
  };
  
  // CONI APR status bits (some used in CONO APR)
  union APRState {

    struct ATTRPACKED {
      unsigned intLevel: 3;
      unsigned intRequest: 1;

      APRFlags active;
      unsigned: 4;

      unsigned sweepBusy: 1;
      unsigned: 5;

      APRFlags enabled;

      unsigned: 6;
    };

    uint64_t u: 36;
  } aprState;


  // CONO APR function bits
  union APRFunctions {

    struct ATTRPACKED {
      unsigned intLevel: 3;
      unsigned: 1;

      APRFlags select;

      unsigned set: 1;
      unsigned clear: 1;
      unsigned disable: 1;
      unsigned enable: 1;

      unsigned clearIO: 1;
      unsigned: 1;
    };

    unsigned u: 18;

    APRFunctions(unsigned v) :u(v) {};
  };

  struct APRLevels {
    unsigned sweepDone: 3;
    unsigned powerFailure: 3;
    unsigned addrParity: 3;
    unsigned cacheDirParity: 3;
    unsigned mbParity: 3;
    unsigned ioPageFail: 3;
    unsigned noMemory: 3;
    unsigned sbusError: 3;
  } aprLevels;

  // PI CONO function bits
  union PIFunctions {
    PIFunctions(unsigned v) :u(v) {};

    struct ATTRPACKED {
      unsigned levels: 7;

      unsigned turnPIOn: 1;
      unsigned turnPIOff: 1;

      unsigned levelsOff: 1;
      unsigned levelsOn: 1;
      unsigned levelsInitiate: 1;
      
      unsigned clearPI: 1;
      unsigned dropRequests: 1;
      unsigned: 1;

      unsigned writeEvenParityDir: 1;
      unsigned writeEvenParityData: 1;
      unsigned writeEvenParityAddr: 1;
    };

    unsigned u: 18;
  };

  // PI state and CONI bits
  union PIState {

    struct ATTRPACKED {
      unsigned levelsEnabled: 7;
      unsigned piEnabled: 1;
      unsigned intInProgress: 7;
      unsigned writeEvenParityDir: 1;
      unsigned writeEvenParityData: 1;
      unsigned writeEvenParityAddr: 1;
      unsigned levelsRequested: 7;
      unsigned: 11;
    };

    uint64_t u: 36;

    PIState() :u(0) {};
  } piState;


  // APRID value see 1982_ProcRefMan.pdf p.244
  inline static const union {

    struct ATTRPACKED {
      unsigned serialNumber: 12;

      unsigned: 1;
      unsigned masterOscillator: 1;
      unsigned extendedKL10: 1;
      unsigned channelSupported: 1;
      unsigned cacheSupported: 1;
      unsigned AC50Hz: 1;

      unsigned microcodeVersion: 9;
      unsigned: 6;
      unsigned exoticMicrocode: 1;
      unsigned extendedAddressing: 1;
      unsigned tops20Paging: 1;
    };

    uint64_t u: 36;
  } aprIDValue = {
    04321,			// Processor serial number
    1,				// Master oscillator
    1,				// Extended KL10
    1,				// Channel support
    0,				// No cache support
    0,				// 60Hz,
    0442,			// Microcode version number
    0,				// "Exotic" microcode
    1,				// Microcode handles extended addresses
    1,				// TOPS-20 paging
  };

  // See 1982_ProcRefMan.pdf p.262
  struct DTE20ControlBlock {
    W36 to11BP;
    W36 to10BP;
    W36 vectorInsn;
    W36 reserved;
    W36 examineAreaSize;
    W36 examineAreaReloc;
    W36 depositAreaSize;
    W36 depositAreaReloc;
  };


  // See 1982_ProcRefMan.pdf p.230
  struct ExecutiveProcessTable {

    struct {
      W36 initialCommand;
      W36 statusWord;
      W36 lastUpdatedCommand;
      W36 reserved;
    } channelLogout[8];

    W36 reserved40_41[2];	// 040

    W36 pioInstructions[14];

    W36 channelBlockFill[4];	// 060

    W36 reserved64_137[44];
  
    DTE20ControlBlock dte20[4];	// 140

    W36 reserved200_420[145];

    W36 trap1Insn;		// 421
    W36 stackOverflowInsn;	// 422
    W36 trap3Insn;		// 423 (not used in KL10?)

    W36 reserved424_507[52];

    W36 timeBase[2];		// 510
    W36 performanceCount[2];	// 512
    W36 intervalCounterIntInsn;	// 514

    W36 reserved515_537[19];

    W36 execSection[32];	// 540

    W36 reserved600_777[128];	// 600
  };


  struct UserProcessTable {
    W36 reserved000_417[0420];	// 000
    W36 luuoAddr;		// 420
    W36 trap1Insn;		// 421
    W36 stackOverflowInsn;	// 422
    W36 trap3Insn;		// 423 (not used in KL10?)
    W36 muuoFlagsOpAC;		// 424
    W36 muuoOldPC;		// 425
    W36 muuoE;			// 426
    W36 muuoContext;		// 427
    W36 kernelNoTrapMUUOPC;	// 430
    W36 kernelTrapMUUOPC;	// 431
    W36 supvNoTrapMUUOPC;	// 432
    W36 supvTrapMUUOPC;		// 433
    W36 concNoTrapMUUOPC;	// 434
    W36 concTrapMUUOPC;		// 435
    W36 publNoTrapMUUOPC;	// 436
    W36 publTrapMUUOPC;		// 437

    W36 reserved440_477[32];

    W36 pfWord;			// 500
    W36 pfFlags;		// 501
    W36 pfOldPC;		// 502
    W36 pfNewPC;		// 503

    W36 userExecTime[2];	// 504
    W36 userMemRefCount[2];	// 506

    W36 reserved510_537[24];

    W36 userSection[32];	// 540

    W36 reserved600_777[128];	// 600
  };


  union FlagsDWord {
    struct ATTRPACKED {
      unsigned processorDependent: 18; // What does KL10 use here?
      unsigned: 6;
      ProgramFlags flags;
      unsigned pc: 30;
      unsigned: 6;
    };

    uint64_t u: 36;
  };

  // Constructors
  KM10(W36 *physicalMemoryP, uint64_t aMaxInsns = UINT64_MAX)
    : memP(physicalMemoryP),
      maxInsns(aMaxInsns)
  { }


  // Accessors
  bool userMode() {return false;}

  W36 flagsWord() {
    return W36((unsigned) flags.u << 4, pc.rhu);
  }

  // Logging
  inline static bool loadLog{true};
  inline static ofstream loadLogS{"load.log"};


  // The instruction emulator
  void emulate() {
    W36 iw{};
    W36 ea{};
    W36 nextPC = pc;
    W36 tmp;

    uint64_t nInsns = 0;

    auto nyi = [&] {cerr << " [not yet implemented]";};

    function<W36(W36)> swap = [&](W36 src) {return W36(src.rhu, src.lhu);};

    function<W36(W36)> negate = [&](W36 src) {
      W36 v(-src.s);
